export default {
  validation: {
    required: "आवश्यक",
    too_long: "अधिकतम {charLimit} अक्षरों की सीमा पहुँच गई",
    email: {
      required: "ईमेल आवश्यक है",
      valid: "ईमेल मान्य होना चाहिए।",
    },
    password: {
      hint: "कृपया अपना पासवर्ड दर्ज करें",
      required: "पासवर्ड आवश्यक है",
      length: "पासवर्ड कम से कम {minLength} अक्षरों का होना चाहिए",
      match: "पासवर्ड समान होना चाहिए",
      no_match: "पासवर्ड पुराने पासवर्ड से अलग होना चाहिए",
      format:
        "पासवर्ड में कम से कम एक बड़ा अक्षर, एक छोटा अक्षर, एक संख्या और निम्न सूची से एक विशेष अक्षर ($!%*?) होना चाहिए।",
    }
  },
  error: {
    login_failed: "साइन इन करने में असमर्थ।",
    competition_not_joined: "माफ़ करें, आपकी शर्त स्वीकार नहीं की जा सकी।"
  },
  confirmation: {
    competition_joined: "आपकी भागीदारी की पुष्टि हो गई है!",
  }
};
